from app.hubs_new_morelink.upload import dahuo_upload
if __name__ == "__main__":
    orders = [
        {
            "搜索CODE": "ABE2",
            "FBA号": "FBA123456",
            "预计数量": 3,
            "预计体积": 0.06,
            "预计重量": 15.4,
            "发货单位": "XMHX-厦门和新-JX",
            "业务类型": "空运",
            "报关方式": "正本-校验",
            "清关方式": "LDP",
            "自营渠道": "空运标准",
            "客户渠道": "空运标准",
            "产品性质": "普货",
            "提货方式": "上门提货",
            "上门提货日期": "2025-07-10 00:00",
            "送货仓库": "上海仓",
            "预计入仓时间": "",
            "司机资料": "",
            "国家": "美国",
            "客户内部号": "",
            "报价单价": 43,
            "成本单价": 43,
            "业务备注": "",
            "标记栏": "汉波：15980826732",
        }
    ]

    upload_data = dahuo_upload(orders)